--- a/content/react/synthetic-event/index.md
+++ b/content/react/synthetic-event/index.md
@@ -113,37 +111,44 @@ registrationNameDependencies = {
-经过 `listenToAllSupportedEvents` 方法处理后，任何在根节点内触发的被当前运行环境支持的事件，都会对应的事件的监听函数。以 `click` 事件为例：
+经过 listenToAllSupportedEvents 方法处理后，可以支持任何在根节点内触发的被当前运行环境支持的事件。以 `click` 事件为例整体流程如下：
 
-```dot
-digraph graphname {
-  node [shape=box];
-  dispatchEvent [label="通过根节点触发事件，调用dispatchEvent"];
-  attemptToDispatchEvent [label="通过 attemptToDispatchEvent 获取目标DOM"];
-  dispatchEventForPluginEventSystem [label="dispatchEventForPluginEventSystem"];
-  dispatchEventsForPlugins [label="dispatchEventsForPlugins"];
-  extractEvents [label="extractEvents 获取事件队列 listeners"];
-  accumulateSinglePhaseListeners [label="accumulateSinglePhaseListeners \n获取触发本次事件的fiber节点并依次查找直到根节点\n获取每个节点上的onClick方法并添加到listeners队列"];
-  processDispatchQueueItemsInOrder [label="processDispatchQueueItemsInOrder"];
-  invokeGuardedCallback [label="调用listeners队列中的onClick方法"];
+```mermaid
+graph TD
+dispatchEvent["触发 click 事件，冒泡到根节点调用绑定的方法 dispatchEvent"]
+dispatchEvent --> findInstanceBlockingEvent["通过 dispatchEventForPluginEventSystem 获取目标 DOM"]
+findInstanceBlockingEvent --> dispatchEventForPluginEventSystem["dispatchEventForPluginEventSystem"]
+dispatchEventForPluginEventSystem --> extractEvents["通过 extractEvents 生成事件队列 listeners"]
+extractEvents --> accumulateSinglePhaseListeners["accumulateSinglePhaseListeners <br/>获取触发本次事件的 fiber 节点并依次查找直到根节点<br/>获取每个节点上的 onClick 方法并添加到 dispatchQueue 队列"]
+accumulateSinglePhaseListeners --> processDispatchQueue["遍历 dispatchQueue 队列，依次调用各自的 onClick 方法"]
+```
 
-  dispatchEvent -> attemptToDispatchEvent;
-  attemptToDispatchEvent -> dispatchEventForPluginEventSystem;
-  dispatchEventForPluginEventSystem -> dispatchEventsForPlugins;
-  dispatchEventsForPlugins -> extractEvents;
-  accumulateSinglePhaseListeners -> extractEvents;
-  extractEvents -> processDispatchQueueItemsInOrder;
-  processDispatchQueueItemsInOrder -> executeDispatch;
-  executeDispatch -> invokeGuardedCallback;
@@
 }
 ```
+
+然后调用 processDispatchQueue 遍历 dispatchQueue 队列，对 listeners 依次调用。
